Revit 2027 API
Element.IsHidden Method
Identifies if the element has been permanently hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsHidden(
	View pView
)
Public Function IsHidden (
	pView As View
) As Boolean
public:
bool IsHidden(
	View^ pView
)
member IsHidden :
        pView : View -> bool
Parameters
pView View
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException | Thrown when argument is null.
Remarks
This does not determine if the element is hidden as a result of temporary hide/isolate, view sectioning, view crop box, or other operations that can cause elements not to be visible. To hide or unhide an element, use the Hide() and Unhide() method of View.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace